In [104]:
# In this exercise we need to find out salary to give Employee based on his 
# Experience, written test and interview skill
# suppoese his Experience, written test and interview skill as 2,9,6 and 12,10,10

In [105]:
# 1. Import libraries and modules
import numpy as np
import pandas as pd
from sklearn import preprocessing
from sklearn.ensemble import RandomForestRegressor
from sklearn.pipeline import make_pipeline
from sklearn.model_selection import GridSearchCV
from sklearn.metrics import mean_squared_error, r2_score
from sklearn.externals import joblib 
from sklearn import linear_model
import matplotlib.pyplot as plt
# In this practice we going to use below methods Train_test_split
from sklearn.model_selection import train_test_split
# Add below library for word data to convert into numrical values
#from textwrap import TextWrapper
from word2number import w2n

In [106]:
# 2. Read the file
df = pd.read_csv('E:/ML/HiringEmp1.csv')
df

  experience  test_score_out10  interview_score_out10  salaryUSD
0        NaN               8.0                      9      50000
1        NaN               8.0                      6      45000
2       five               6.0                      7      60000
3        two              10.0                     10      65000
4      seven               9.0                      6      70000
5      three               7.0                     10      62000
6        ten               NaN                      7      72000
7     eleven               7.0                      8      80000

In [107]:
# 3. Get the database information
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 4 columns):
experience               6 non-null object
test_score_out10         7 non-null float64
interview_score_out10    8 non-null int64
salaryUSD                8 non-null int64
dtypes: float64(1), int64(2), object(1)
memory usage: 336.0+ bytes

In [108]:
# 4. Check the frist few rows
df.head(3)

  experience  test_score_out10  interview_score_out10  salaryUSD
0        NaN               8.0                      9      50000
1        NaN               8.0                      6      45000
2       five               6.0                      7      60000

In [109]:
# 5. validate the dataset if any null values
# in column if vlaues is true then that row is null value
# Dataframe.isnll().sum() it will show the total null values in each coloum
df.isnull().sum()

experience               2
test_score_out10         1
interview_score_out10    0
salaryUSD                0
dtype: int64

In [110]:
# 6. find the which row values is null 
df.experience.isnull()

0     True
1     True
2    False
3    False
4    False
5    False
6    False
7    False
Name: experience, dtype: bool

In [111]:
# 7. find the which row values is null
df.test_score_out10.isnull()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
7    False
Name: test_score_out10, dtype: bool

In [112]:
# 8. Fill the null value with zero
df.experience=df.experience.fillna("zero")
df

  experience  test_score_out10  interview_score_out10  salaryUSD
0       zero               8.0                      9      50000
1       zero               8.0                      6      45000
2       five               6.0                      7      60000
3        two              10.0                     10      65000
4      seven               9.0                      6      70000
5      three               7.0                     10      62000
6        ten               NaN                      7      72000
7     eleven               7.0                      8      80000

In [113]:
# 9. below line replace the word to numeric values in table
# see the column expericnce in table
df.experience = df.experience.apply(w2n.word_to_num)

In [114]:
#df.test_score_out10.fillna('0')
#df.test_score_out10=df.test_score_out10.fillna("0")

In [115]:
#df.test_score_out10=df.test_score_out10.apply(w2n.word_to_num)

In [116]:
# 10. check the dataset
df

   experience  test_score_out10  interview_score_out10  salaryUSD
0           0               8.0                      9      50000
1           0               8.0                      6      45000
2           5               6.0                      7      60000
3           2              10.0                     10      65000
4           7               9.0                      6      70000
5           3               7.0                     10      62000
6          10               NaN                      7      72000
7          11               7.0                      8      80000

In [117]:
# 11. below code for column test_score_out10 for filling the "NaN" values
# get the median of test_score_out10 column and fill that value
import math
median_test_score = math.floor(df['test_score_out10'].mean())
median_test_score

7

In [118]:
# 12. Fill the NaN value
df['test_score_out10'] = df['test_score_out10'].fillna(median_test_score)

In [119]:
# 13. Now our table is good for modeling
df

   experience  test_score_out10  interview_score_out10  salaryUSD
0           0               8.0                      9      50000
1           0               8.0                      6      45000
2           5               6.0                      7      60000
3           2              10.0                     10      65000
4           7               9.0                      6      70000
5           3               7.0                     10      62000
6          10               7.0                      7      72000
7          11               7.0                      8      80000

In [120]:
# 14. Do the modeling by using linear Regression
reg = linear_model.LinearRegression()

In [121]:
# 15. Fit means we are doning training on data set 
# we need to find out the how much salary we need to give employee
reg.fit(df[['experience','test_score_out10','interview_score_out10']], df['salaryUSD'])

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=1, normalize=False)

In [122]:
# 16. we can provide the experience,test_score_out10,interview_score_out10 and get how much salary you can offer
reg.predict([[2,9,6]])

array([53713.86677124])

In [123]:
# 17. we can provide the experience(12),test_score_out10(10),interview_score_out10(10)
# and get how much salary you can offer
reg.predict([[12,10,10]])

array([93747.79628651])